In [2]:
import pandas as pd

In [3]:
bricks = {
    "country" : ['Brazil' , 'Russia' , 'India' , 'China' , 'South Africa'],
    "capital" : ['Brazil' , 'Moscow' , 'New Delhi' , 'Beijing' , 'Pretoria'],
    "area" : [8.516 , 17.100 , 3.286 , 9.597 , 1.221],
    "population" : [200.40 , 143.50 , 1252.00 , 1357.00 , 52.98]
}

In [4]:
# Build Dataframe in Above Data
df = pd.DataFrame(bricks)
df

        country    capital    area  population
0        Brazil     Brazil   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [5]:
# BUILD CSV FILE from above Dataframe:
df.to_csv("country information.csv")

In [6]:
# call csv file 
call_csv = pd.read_csv(r"C:\Users\dell\Documents\Python\EDA\EDA Practice\country information.csv" , index_col=0)
call_csv

        country    capital    area  population
0        Brazil     Brazil   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [7]:
# CHANGE index ---> numeric to categorical
df = call_csv
df.index = ["BR" , "RU" , "IN" , "CH" , "SA"]
df

         country    capital    area  population
BR        Brazil     Brazil   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Delhi   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

In [8]:
# call column one 
call_column_one = df['country']
call_column_one

BR          Brazil
RU          Russia
IN           India
CH           China
SA    South Africa
Name: country, dtype: object

In [9]:
# call column one but show proper DataFrame
call_column_one = df[['country']]
call_column_one

         country
BR        Brazil
RU        Russia
IN         India
CH         China
SA  South Africa

In [10]:
# call first two column
call_two_columns = df[['country' , 'capital']]
call_two_columns

         country    capital
BR        Brazil     Brazil
RU        Russia     Moscow
IN         India  New Delhi
CH         China    Beijing
SA  South Africa   Pretoria

In [11]:
# calls any two columns
call_any_two_columns = df[['country' , 'population']]
call_any_two_columns

         country  population
BR        Brazil      200.40
RU        Russia      143.50
IN         India     1252.00
CH         China     1357.00
SA  South Africa       52.98

In [12]:
# first two rows 
first_two_rows = df[0:2]
first_two_rows

   country capital    area  population
BR  Brazil  Brazil   8.516       200.4
RU  Russia  Moscow  17.100       143.5

In [13]:
# any three rows 
any_three_rows = df[2:]
any_three_rows

         country    capital   area  population
IN         India  New Delhi  3.286     1252.00
CH         China    Beijing  9.597     1357.00
SA  South Africa   Pretoria  1.221       52.98

In [14]:
# negative indexing 
df = df[-3:-1]
df

   country    capital   area  population
IN   India  New Delhi  3.286      1252.0
CH   China    Beijing  9.597      1357.0

In [15]:
df = df[-3:]
df

   country    capital   area  population
IN   India  New Delhi  3.286      1252.0
CH   China    Beijing  9.597      1357.0

In [16]:
# print first two rows & only first column 
two_rows_and_first_column = df[:2]['country']
two_rows_and_first_column

IN    India
CH    China
Name: country, dtype: object

#### loc function

In [17]:
lc = two_rows_and_first_column.loc['IN']
lc

'India'

In [33]:
lc = df.loc['IN']
lc

country           India
capital       New Delhi
area              3.286
population       1252.0
Name: IN, dtype: object